[
  {
      "name": "Cat Nip",
      "description": "Indulge your cat's senses with our irresistible catnip! From toys to treats, discover premium catnip products that will keep your furry friend entertained for hours. Don't miss out on these aromatic delights – shop now and bring joy to your cat's playtime!",
      "price": 15,
      "currentPrice": 20,
      "stock": 25,
      "image": "catnip.png",
      "category": "food"
  },
  {
      "name": "Toy Mouse",
      "description": "Ignite your cat's inner hunter with our toy mouse! Featuring lifelike designs and interactive features, these toys provide hours of entertainment. Shop now and watch your furry friend pounce and play!",
      "price": 10,
      "currentPrice": 10,
      "stock": 50,
      "image": "toy_mouse.png",
      "category": "toy"
  },
  {
      "name": "Cat Tree",
      "description": "Treat your cat to the ultimate playground with our cat tree! Featuring cozy perches and satisfying scratching posts, it's the purrfect way to keep your kitty happy.",
      "price": 100,
      "currentPrice": 100,
      "stock": 10,
      "image": "cat_tree.png",
      "category": "furniture"
      
  },
  {
    "name": "Fish Toy",
    "description": "Dive into aquatic fun with our fish toy for cats! Lifelike designs and tempting textures keep your kitty entertained for hours. Watch them pounce and chase their new underwater friend. Shop now for endless playtime!",
    "price": 100,
    "stock": 45,
    "image": "fish_toy.png",
    "category": "toy"
  },
  {
    "name": "Neon Worm",
    "description":     
      "Spark excitement in your cat with our neon worms! These vibrant, glowing toys awaken hunting instincts and offer endless play. Watch as your cat pounces and bats at these mesmerizing critters. Get yours now!",
    "price": 10,
    "stock": 30,
    "image": "neon_worms.png",
    "category": "toy"
  },
      {
      "name": "Cat Bed",
      "description": "Indulge your feline friend with our Deluxe Plush Cat Bed! Ultra-soft faux fur lining, supportive design, and easy maintenance make it the perfect cozy retreat. Give your cat the comfort they crave!",
      "price": 75,
      "currentPrice": 75,
      "stock": 25,
      "image": "cat_bed.png",
      "category": "furniture"
      
  }
]