[
  {
      "name": "Cat Nip",
      "description": "Indulge your cat's senses with our irresistible catnip! From toys to treats, discover premium catnip products that will keep your furry friend entertained for hours. Don't miss out on these aromatic delights – shop now and bring joy to your cat's playtime!",
      "price": 15,
      "currentPrice": 20,
      "stock": 25,
      "image": "catnip.png",
      "category": "food"
  },
  {
      "name": "Toy Mouse",
      "description": "Bring out the hunter in your cat with our toy mouse! Explore a variety of playful mice designed to stimulate your cat's natural instincts and provide hours of entertainment. With lifelike designs and interactive features, these toys are sure to captivate your furry friend's attention. Don't miss this opportunity to add excitement to your cat's playtime – shop now and watch them pounce and play!",
      "price": 10,
      "currentPrice": 10,
      "stock": 50,
      "image": "toy_mouse.png",
      "category": "toy"
  },
  {
      "name": "Cat Tree",
      "description": "Give your feline friend the ultimate playground with our cat tree! From cozy perches to satisfying scratching posts, find the purrfect tree to keep your kitty entertained and happy. Don't miss out on these paws-itively great deals – shop now and treat your cat to endless fun and relaxation!",
      "price": 100,
      "currentPrice": 100,
      "stock": 10,
      "image": "cat_tree.png",
      "category": "furniture"
      
  },
  {
    "name": "Fish Toy",
    "description": "Introduce your feline friend to a world of aquatic adventure with our fish toy for cats! Crafted with lifelike designs and tantalizing textures, these fish toys are sure to reel in your kitty's curiosity. Watch as they pounce, bat, and chase after their new underwater friend, providing hours of entertainment and mental stimulation. Treat your cat to the thrill of the hunt – dive into our fish toy sale today!",
    "price": 100,
    "stock": 45,
    "image": "fish_toy.png",
    "category": "toy"
  },
  {
    "name": "Neon Worm",
    "description":     
      "Light up playtime for your furry companion with our neon worms for cats! These vibrant, glowing toys are designed to captivate your cat's attention and ignite their natural instincts for hunting and exploration. With their irresistible colors and wriggling movements, these neon worms will keep your cat entertained for hours on end. Watch as they chase, pounce, and bat at these glowing critters, providing endless fun and excitement. Bring a dash of neon magic to your cat's playtime – shop our neon worm collection now!",
    "price": 10,
    "stock": 30,
    "image": "neon_worms.png",
    "category": "toy"
  }
]